# Import Pandas Library

In [3]:
import pandas as pd
import numpy as np

# Data Structures

## First: Series

In [6]:
lst = [1,2,3,4,5] 
s = pd.Series(lst)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# change dtype
s = pd.Series(lst, dtype= float)
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [8]:
# choose indexes
s = pd.Series(lst, index=['A', 'B', 'C', 'D', 'E' ])
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [9]:
index = [10, 12, 13, 14]
names = ['Nourah', 'Sarah', 'Ahmed', 'Lama']
s2 = pd.Series(names, index=index)
s2

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [62]:
# use dictionary 
names = {10: 'Nourah', 12: 'Sarah', 13: 'Ahmed', 14: 'Lama'}
s3 = pd.Series(names)
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [13]:
names.keys()

dict_keys([10, 12, 13, 14])

In [12]:
pd.Series(names.keys(), names.values())

Nourah    10
Sarah     12
Ahmed     13
Lama      14
dtype: int64

In [28]:
# change the indexes
s3.index = [10, 20, 30, 40]
s3[0:1]

10    Nourah
dtype: object

In [21]:
fruit1 = {'Apple': 40 , 'Banana': 50, 'Orange': 60}
ser1 = pd.Series(fruit1)

fruit2 = {'Apple': 30 , 'Strawberry': 20, 'Orange': 20}
ser2 = pd.Series(fruit2)

In [23]:
s3[30]

'Ahmed'

In [24]:
# Selecting
print(s3[20]) # index = 20

Sarah

In [25]:
# Slicing like numpy [start, end(execluded), gap]
# Note that the slice does not use the index labels as references, but the position
s3[:3] # from position 0 to 2

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [31]:
s3[:-1] # from 0 to last item(execluded)

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [34]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [63]:
# Add elements 
s4 = pd.Series({50: 'Ahmed', 60: 'Nada'})
s3 = s3._append(s4)
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
50     Ahmed
60      Nada
dtype: object

In [49]:
x = pd.Series(['a', 'b'])
y = pd.Series(['c', 'd'])
z = pd.concat([x, y])
z

0    a
1    b
0    c
1    d
dtype: object

In [48]:
z

0    a
1    b
2    c
3    d
dtype: object

In [47]:
z.reset_index(inplace=True, drop=True)

In [39]:
y

0    c
1    d
dtype: object

In [50]:
z = pd.concat([x, y],ignore_index=True )
z

0    a
1    b
2    c
3    d
dtype: object

In [59]:
# delete an element 
s3 = s3.drop(s3[:1].index)

In [58]:
s3[:1]

40    Lama
dtype: object

In [65]:
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
50     Ahmed
60      Nada
dtype: object

In [64]:
# drop duplicate elements
s3.drop_duplicates()

10    Nourah
12     Sarah
13     Ahmed
14      Lama
60      Nada
dtype: object

In [66]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [67]:
s4 = s.copy()
s4

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [69]:
s4 = s4+3
s4

A     6
B     9
C    12
D    15
E    18
dtype: int64

In [70]:
s4.add(s)

A     7
B    11
C    15
D    19
E    23
dtype: int64

In [75]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [79]:
s5

A    6
B    8
dtype: int64

In [87]:
s5 = pd.Series({'A': 6, 'B': 8})
s5 = s5.add(s, fill_value=0)

In [88]:
s5 # you have to save the result

A     7.0
B    10.0
C     3.0
D     4.0
E     5.0
dtype: float64

In [82]:
s4

A     6
B     9
C    12
D    15
E    18
dtype: int64

In [83]:
s4.sub(s)

A     5
B     7
C     9
D    11
E    13
dtype: int64

In [84]:
s4.mul(s)

A     6
B    18
C    36
D    60
E    90
dtype: int64

In [85]:
s4.div(s)

A    6.00
B    4.50
C    4.00
D    3.75
E    3.60
dtype: float64

## Second: DataFrame

### A- Creating a new DataFrame from the scratch

In [93]:
data = {'SalesPerson': ['Kathey', 'Michael', 'William', 'Kathey', 'William', 'Kathey', 'Michael'],
        'Region': ['East', 'West', 'North', 'South', 'North', 'North', 'East'],
        'OrderAmount': [600, 700, 400, 500, 400, 700, 800],
        'Month': ['Jan', 'Feb', 'Feb', 'Mar', 'May', 'Apr', 'May'],
        'isAccepted': [True, False, False, True, True, True, False]
       }

SalesDF = pd.DataFrame(data)
SalesDF

  SalesPerson Region  OrderAmount Month  isAccepted
0      Kathey   East          600   Jan        True
1     Michael   West          700   Feb       False
2     William  North          400   Feb       False
3      Kathey  South          500   Mar        True
4     William  North          400   May        True
5      Kathey  North          700   Apr        True
6     Michael   East          800   May       False

In [96]:
SalesDF.columns = {'A': 'Esraa'
                   , 'S', 'D', 'F', 't'}

In [98]:
SalesDF

         A      S    D    F      t
0   Kathey   East  600  Jan   True
1  Michael   West  700  Feb  False
2  William  North  400  Feb  False
3   Kathey  South  500  Mar   True
4  William  North  400  May   True
5   Kathey  North  700  Apr   True
6  Michael   East  800  May  False

In [99]:
data = {'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012],
        'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 'RMadrid', 'RMadrid', 'ValenciaCF',
                 'ValenciaCF', 'ValenciaCF'],
        'wins':   [30, 28, 32, 29, 32, 26, 21, 17, 19],
        'draws':  [6, 7, 4, 5, 4, 7, 8, 10, 8],
        'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]}

football = pd.DataFrame(data)
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

### B- Reading tabular data

In [110]:
edu = pd.read_csv('Data/educ_figdp_1_Data.csv')
edu.head(2)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [104]:
edu.shape

(384, 5)

In [105]:
edu.columns

Index(['TIME', 'GEO', 'INDIC_ED', 'Value', 'Flag and Footnotes'], dtype='object')

In [107]:
edu.size

1920

In [106]:
edu.dtypes

TIME                   int64
GEO                   object
INDIC_ED              object
Value                 object
Flag and Footnotes    object
dtype: object

# Viewing Data

In [111]:
edu.head() #first rows that are listed

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [112]:
edu.head(3)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [113]:
edu.shape

(384, 5)

In [114]:
edu.tail() #last rows that are listed

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [115]:
edu.columns

Index(['TIME', 'GEO', 'INDIC_ED', 'Value', 'Flag and Footnotes'], dtype='object')

In [ ]:
edu.columns =

In [116]:
edu.columns[0]

'TIME'

In [119]:
edu.index

RangeIndex(start=0, stop=384, step=1)

In [120]:
edu.values # values of any DataFrame can be retrieved as a Python array by calling its values attribute.

array([[2000, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        ':', nan],
       [2001, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        ':', nan],
       [2002, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '5.00', 'e'],
       ...,
       [2009, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.81', nan],
       [2010, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.85', nan],
       [2011, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.76', nan]], dtype=object)

In [122]:
edu.head(2)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [123]:
edu.dtypes

TIME                   int64
GEO                   object
INDIC_ED              object
Value                 object
Flag and Footnotes    object
dtype: object

In [129]:
edu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 384 entries, 0 to 383
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   TIME                384 non-null    int64
 1   GEO                 384 non-null    object
 2   INDIC_ED            384 non-null    object
 3   Value               384 non-null    object
 4   Flag and Footnotes  165 non-null    object
dtypes: int64(1), object(4)
memory usage: 15.1+ KB

In [121]:
# quick statistical information
edu.describe()

              TIME
count   384.000000
mean   2005.500000
std       3.456556
min    2000.000000
25%    2002.750000
50%    2005.500000
75%    2008.250000
max    2011.000000

In [124]:
edu.describe(include=[object])

,GEO,INDIC_ED,Value,Flag and Footnotes
count,384,384,384,165
unique,32,1,211,6
top,European Union (28 countries),Total public expenditure on education as % of ...,:,e
freq,12,384,23,70

In [125]:
edu.describe(exclude="number")

,GEO,INDIC_ED,Value,Flag and Footnotes
count,384,384,384,165
unique,32,1,211,6
top,European Union (28 countries),Total public expenditure on education as % of ...,:,e
freq,12,384,23,70

In [128]:
edu.T#[:2]

,0,1,2,3,4,5,6,7,8,9,...,374,375,376,377,378,379,380,381,382,383
TIME,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
GEO,European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),...,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland
INDIC_ED,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...
Value,:,:,5.00,5.03,4.95,4.92,4.91,4.92,5.04,5.38,...,6.22,6.43,6.42,6.30,6.18,5.90,6.10,6.81,6.85,6.76
Flag and Footnotes,NaN,NaN,e,e,e,e,e,e,e,e,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Selection

In [130]:
edu.head(2)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [132]:
type(edu['Value']) # The result will be a Series data structure, not a DataFrame, because only one column is retrieved.

pandas.core.series.Series

In [138]:
edu[['Value','GEO']]

    Value                            GEO
0       :  European Union (28 countries)
1       :  European Union (28 countries)
2    5.00  European Union (28 countries)
3    5.03  European Union (28 countries)
4    4.95  European Union (28 countries)
..    ...                            ...
379  5.90                        Finland
380  6.10                        Finland
381  6.81                        Finland
382  6.85                        Finland
383  6.76                        Finland

[384 rows x 2 columns]

In [135]:
edu[10:14] # select a subset of rows from a DataFrame

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s

In [141]:
edu.iloc[ 0:3 , 0:2]

   TIME                            GEO
0  2000  European Union (28 countries)
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)

In [140]:
edu.loc[ 0:3 , ['Value','GEO']]  #[rows, columns]

  Value                            GEO
0     :  European Union (28 countries)
1     :  European Union (28 countries)
2  5.00  European Union (28 countries)
3  5.03  European Union (28 countries)

In [ ]:
edu.loc[90:94,:] #[rows, columns=all]

In [150]:
edu.sample(10, random_state=23) # random sample >> 23 seed for random number generator.
# seed makes the random numbers predictable

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
294,2006,Netherlands,Total public expenditure on education as % of ...,5.50,NaN
343,2007,Romania,Total public expenditure on education as % of ...,4.25,NaN
178,2010,Greece,Total public expenditure on education as % of ...,:,NaN
73,2001,Euro area (13 countries),Total public expenditure on education as % of ...,4.97,s
284,2008,Malta,Total public expenditure on education as % of ...,5.72,i
193,2001,France,Total public expenditure on education as % of ...,5.95,NaN
236,2008,Latvia,Total public expenditure on education as % of ...,5.71,NaN
205,2001,Italy,Total public expenditure on education as % of ...,4.83,NaN
59,2011,Euro area (17 countries),Total public expenditure on education as % of ...,5.15,e
252,2000,Luxembourg,Total public expenditure on education as % of ...,:,NaN

# Filtering Data

In [157]:
edu[edu['TIME'] == 2011]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
23,2011,European Union (27 countries),Total public expenditure on education as % of ...,5.25,e
35,2011,European Union (25 countries),Total public expenditure on education as % of ...,5.31,e
47,2011,Euro area (18 countries),Total public expenditure on education as % of ...,5.15,e
59,2011,Euro area (17 countries),Total public expenditure on education as % of ...,5.15,e
71,2011,Euro area (15 countries),Total public expenditure on education as % of ...,5.16,e
83,2011,Euro area (13 countries),Total public expenditure on education as % of ...,5.15,e
95,2011,Belgium,Total public expenditure on education as % of ...,6.55,d
107,2011,Bulgaria,Total public expenditure on education as % of ...,3.82,NaN
119,2011,Czech Republic,Total public expenditure on education as % of ...,4.51,NaN
131,2011,Denmark,Total public expenditure on education as % of ...,8.75,d
143,2011,Germany (until 1990 former territory of the FRG),Total public expenditure on education as % of ...,4.98,NaN
155,2011,Estonia,Total public expenditure on education as % of ...,5.16,NaN
167,2011,Ireland,Total public expenditure on education as % of ...,6.15,NaN
179,2011,Greece,Total public expenditure on education as % of ...,:,NaN
191,2011,Spain,Total public expenditure on education as % of ...,4.82,NaN
203,2011,France,Total public expenditure on education as % of ...,5.68,NaN
215,2011,Italy,Total public expenditure on education as % of ...,4.29,NaN
227,2011,Cyprus,Total public expenditure on education as % of ...,7.87,d
239,2011,Latvia,Total public expenditure on education as % of ...,4.96,NaN
251,2011,Lithuania,Total public expenditure on education as % of ...,5.17,NaN
263,2011,Luxembourg,Total public expenditure on education as % of ...,:,NaN
275,2011,Hungary,Total public expenditure on education as % of ...,4.71,NaN
287,2011,Malta,Total public expenditure on education as % of ...,7.96,NaN
299,2011,Netherlands,Total public expenditure on education as % of ...,5.93,NaN
311,2011,Austria,Total public expenditure on education as % of ...,5.80,NaN
323,2011,Poland,Total public expenditure on education as % of ...,4.94,NaN
335,2011,Portugal,Total public expenditure on education as % of ...,5.27,d
347,2011,Romania,Total public expenditure on education as % of ...,3.07,NaN
359,2011,Slovenia,Total public expenditure on education as % of ...,5.68,NaN
371,2011,Slovakia,Total public expenditure on education as % of ...,4.06,d
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [ ]:
# Another way of selection
# by applying Boolean indexing. This indexing is commonly known as a filter. 
edu[edu['Value'] > 6.5]

# Filtering Missing and dupliacated Values

In [174]:
edu[(~edu['Flag and Footnotes'].isnull()) & (edu['TIME'] == 2011) ]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
23,2011,European Union (27 countries),Total public expenditure on education as % of ...,5.25,e
35,2011,European Union (25 countries),Total public expenditure on education as % of ...,5.31,e
47,2011,Euro area (18 countries),Total public expenditure on education as % of ...,5.15,e
59,2011,Euro area (17 countries),Total public expenditure on education as % of ...,5.15,e
71,2011,Euro area (15 countries),Total public expenditure on education as % of ...,5.16,e
83,2011,Euro area (13 countries),Total public expenditure on education as % of ...,5.15,e
95,2011,Belgium,Total public expenditure on education as % of ...,6.55,d
131,2011,Denmark,Total public expenditure on education as % of ...,8.75,d
227,2011,Cyprus,Total public expenditure on education as % of ...,7.87,d
335,2011,Portugal,Total public expenditure on education as % of ...,5.27,d
371,2011,Slovakia,Total public expenditure on education as % of ...,4.06,d

In [ ]:
edu[edu['Value'].isnull()].head()

In [170]:
edu[edu.duplicated()]

Empty DataFrame
Columns: [TIME, GEO, INDIC_ED, Value, Flag and Footnotes]
Index: []

In [ ]:
edu.drop_duplicates('Value')

# Manipulating Data

In [175]:
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [176]:
edu['Value'].head()

0       :
1       :
2    5.00
3    5.03
4    4.95
Name: Value, dtype: object

In [178]:
edu['TIME'] / 100 # you can apply it by one step

0      20.00
1      20.01
2      20.02
3      20.03
4      20.04
       ...
379    20.07
380    20.08
381    20.09
382    20.10
383    20.11
Name: TIME, Length: 384, dtype: float64

In [ ]:
# we can apply any function to a DataFrame or Series
edu['Value'].apply(np.sqrt) # sqrt function from the numpy library

In [205]:
def f2(x, r ):
    if x > 2002 and r == ":":
        return 1
    else:
        return 0

In [207]:
edu['new'] = edu[['TIME', 'Value']].apply(lambda c : f2(c[0],c[1]), axis=1)

/var/folders/9n/yvd02hfx57z6hx0832zwsdrr0000gn/T/ipykernel_11527/1645867839.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  edu['new'] = edu[['TIME', 'Value']].apply(lambda c : f2(c[0],c[1]), axis=1)

In [188]:
edu.drop('TIME_1', axis=1, inplace=True)

In [189]:
edu.head(2)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes,TIME_sqrt
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,44.721360
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,44.732538

In [ ]:
def f2(x):
    return x**2
edu['Value'].apply(f2)

In [ ]:
edu['Value'].apply(lambda d: d**2)

In [ ]:
# add a new column to a DataFrame
edu['ValueNorm'] =

In [ ]:
edu[['Value','TIME']].apply(lambda)

In [ ]:
# add a new column to a DataFrame
edu['ValueNorm'] = edu['Value'] / edu['Value'].max()
edu.tail()

In [ ]:
edu

In [ ]:
# remove this column from the DataFrame
# rows(axis=0), columns(axis=1) 
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop('ValueNorm', axis=1, inplace=True)
edu.head()

In [ ]:
edu

In [210]:
# insert a new row
# ignore_index=True, otherwise the index 0
edu = edu._append({'TIME': 2000, 'Value': 5.00, 'GEOq': 'a'}, ignore_index=True)
edu.tail()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes,TIME_sqrt,new,GEOq
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN,44.821870,0.0,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN,44.833024,0.0,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN,44.844175,0.0,NaN
384,2000,a,NaN,5.0,NaN,NaN,NaN,NaN
385,2000,NaN,NaN,5.0,NaN,NaN,NaN,a

In [ ]:
# remove row(axis=0)
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop(max(edu.index), axis=0, inplace=True)
edu.tail()

In [ ]:
# to clear data frame
edu.drop(edu.index, inplace=False)

# Sorting

In [212]:
edu.sort_values(by='TIME', ascending=True, inplace=True)
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes,TIME_sqrt,new,GEOq
385,2000,NaN,NaN,5.0,NaN,NaN,NaN,a
96,2000,Bulgaria,Total public expenditure on education as % of ...,3.88,NaN,44.72136,0.0,NaN
84,2000,Belgium,Total public expenditure on education as % of ...,:,u,44.72136,0.0,NaN
72,2000,Euro area (13 countries),Total public expenditure on education as % of ...,:,u,44.72136,0.0,NaN
60,2000,Euro area (15 countries),Total public expenditure on education as % of ...,:,u,44.72136,0.0,NaN

In [214]:
# to return to the original order, we can sort by an index using the sort_index and axis=0
edu.sort_index(axis=1, ascending=True, inplace=True)
edu.head()

,Flag and Footnotes,GEO,GEOq,INDIC_ED,TIME,TIME_sqrt,Value,new
0,NaN,European Union (28 countries),NaN,Total public expenditure on education as % of ...,2000,44.721360,:,0.0
1,NaN,European Union (28 countries),NaN,Total public expenditure on education as % of ...,2001,44.732538,:,0.0
2,e,European Union (28 countries),NaN,Total public expenditure on education as % of ...,2002,44.743715,5.00,0.0
3,e,European Union (28 countries),NaN,Total public expenditure on education as % of ...,2003,44.754888,5.03,0.0
4,e,European Union (28 countries),NaN,Total public expenditure on education as % of ...,2004,44.766059,4.95,0.0

# Grouping Data

In [ ]:
# By “group by” we are referring to a process involving one or more of the following steps:
# 1. Splitting the data into groups based on some criteria
# 2. Applying a function to each group independently
# 3. Combining the results into a data structure

In [232]:
edu.groupby('GEO')[['TIME', 'INDIC_ED']].max()

,TIME,INDIC_ED
GEO,,
Austria,2011,Total public expenditure on education as % of ...
Belgium,2011,Total public expenditure on education as % of ...
Bulgaria,2011,Total public expenditure on education as % of ...
Cyprus,2011,Total public expenditure on education as % of ...
Czech Republic,2011,Total public expenditure on education as % of ...
Denmark,2011,Total public expenditure on education as % of ...
Estonia,2011,Total public expenditure on education as % of ...
Euro area (13 countries),2011,Total public expenditure on education as % of ...
Euro area (15 countries),2011,Total public expenditure on education as % of ...
Euro area (17 countries),2011,Total public expenditure on education as % of ...
Euro area (18 countries),2011,Total public expenditure on education as % of ...
European Union (25 countries),2011,Total public expenditure on education as % of ...
European Union (27 countries),2011,Total public expenditure on education as % of ...
European Union (28 countries),2011,Total public expenditure on education as % of ...
Finland,2011,Total public expenditure on education as % of ...
France,2011,Total public expenditure on education as % of ...
Germany (until 1990 former territory of the FRG),2011,Total public expenditure on education as % of ...
Greece,2011,Total public expenditure on education as % of ...
Hungary,2011,Total public expenditure on education as % of ...
Ireland,2011,Total public expenditure on education as % of ...
Italy,2011,Total public expenditure on education as % of ...
Latvia,2011,Total public expenditure on education as % of ...
Lithuania,2011,Total public expenditure on education as % of ...
Luxembourg,2011,Total public expenditure on education as % of ...
Malta,2011,Total public expenditure on education as % of ...
Netherlands,2011,Total public expenditure on education as % of ...
Poland,2011,Total public expenditure on education as % of ...
Portugal,2011,Total public expenditure on education as % of ...
Romania,2011,Total public expenditure on education as % of ...
Slovakia,2011,Total public expenditure on education as % of ...
Slovenia,2011,Total public expenditure on education as % of ...
Spain,2011,Total public expenditure on education as % of ...
a,2000,NaN

In [ ]:
# like group by in sql
group = edu[['GEO', 'Value']].groupby('GEO').mean()
group.head()

# Merging Data

In [234]:
np.random.randn(10, 4)

array([[ 0.06826691, -1.92788045, -1.65132126,  0.67862769],
       [-0.10461171, -0.24004139,  0.88199726,  1.01145034],
       [-1.14903721, -0.61954837,  0.67430585, -1.09761326],
       [-0.78425721, -1.78129935,  1.11656285,  0.06223829],
       [ 3.15982201, -1.37595475,  1.09178313,  1.58247488],
       [ 1.81919876, -0.28602022,  1.39879945, -0.78445794],
       [ 1.72050527,  2.61071283,  0.53514346, -0.1448698 ],
       [ 0.93649554,  1.12728133,  1.74288496,  0.8371304 ],
       [-0.05653123, -0.62824739,  0.30529715,  0.28065695],
       [ 2.23664615,  1.85153698, -0.19796402,  0.64327041]])

In [235]:
df = pd.DataFrame(np.random.randn(10, 4))

In [245]:
s = df[:3]
s

          0         1         2         3
0 -0.240788  0.227862  0.545105  0.379449
1  0.554851 -1.165024 -2.662893 -0.612267
2  0.082463 -0.719854 -0.031479  0.278250

In [246]:
ss = df[3:7]
ss

          0         1         2         3
3 -1.335873  0.297832  0.205178 -1.341711
4  1.147045  1.092909  0.046729 -0.396993
5  0.346433 -1.165200  0.189143 -1.281161
6  0.440518 -3.250689 -0.295111 -1.270377

In [ ]:
df[7:]

In [242]:
pd.concat([s, ss], axis=1)

,0,1,2,3,0,1,2,3
0,-0.240788,0.227862,0.545105,0.379449,NaN,NaN,NaN,NaN
1,0.554851,-1.165024,-2.662893,-0.612267,NaN,NaN,NaN,NaN
2,0.082463,-0.719854,-0.031479,0.278250,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,-1.335873,0.297832,0.205178,-1.341711
4,NaN,NaN,NaN,NaN,1.147045,1.092909,0.046729,-0.396993
5,NaN,NaN,NaN,NaN,0.346433,-1.165200,0.189143,-1.281161
6,NaN,NaN,NaN,NaN,0.440518,-3.250689,-0.295111,-1.270377

In [ ]:
pd.merge(left, right, on="key")

# Resources
- Chapter 2, Introduction to Data Science by Laura Igual and Santi Seguí
    - https://github.com/DataScienceUB/introduction-datascience-python-book 
- pandas Documentation: https://pandas.pydata.org/